---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.ConvertElementProperties
source: html/22442a29-5fa9-f928-e661-e4e75f83a9c9.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.ConvertElementProperties Property

True to convert element properties, false otherwise.
 Default value is false.

## Syntax (C#)
```csharp
public bool ConvertElementProperties { get; set; }
```